#+title: MIPS Assembly
#+startup: content

** Size of MIPS Types

| Name  | Size              | C equivalent type |
|-------+-------------------+-------------------|
| BYTE  | 1 byte (8 bits)   | char              |
| HALF  | 2 bytes (16 bits) | short             |
| WORD  | 4 bytes (32 bits) | int / long        |
| DWORD | 8 bytes (64 bits) | long long         |

Notice that, in x86_64, the size of ~long~ type differs:

#+begin_src C :includes <stdio.h> :exports both :cache yes
printf("%d\n", sizeof(char));
printf("%d\n", sizeof(short));
printf("%d\n", sizeof(int));
printf("%d\n", sizeof(long));
printf("%d\n", sizeof(long long));
#+end_src

#+RESULTS[09a9208d0abe4d4711f702b271eb31639b7ea986]:
| 1 |
| 2 |
| 4 |
| 8 |
| 8 |

